{"Buffers/What-is-a-buffer":{"title":"What is a buffer?","links":["Layers/What-is-a-layer","Effects/What-is-an-effect","Layers/Rendering-to-a-buffer","Items/What-is-an-item"],"tags":[],"content":"What is a buffer?\nA buffer is defined as a region of memory that holds the data for an image to be displayed on a screen. Think of it as a ‘screen’. Vizzy has two buffer types.\nScreen buffer\nThis is the buffer that everything gets eventually rendered to by default in Vizzy.\nWhile this is not shown to you, every layer is its own buffer (to allow for effects), but all of their outputs eventually become composited to this screen buffer.\n\n\n                  \n                  Did you know? \n                  \n                \n\nWhen you turn 3D mode on, you are seeing all layer buffers at the same time, which is why they don’t obscure each other.\n\n\nLayer buffer\nThis is a buffer that gets created when you render a layer to a buffer. Every layer will have its own layer buffer. It allows items and effects (even in other layers!) to use the image output of this buffer.\n\n\n                  \n                  Warning! \n                  \n                \n\nRendering a layer to a buffer stops it from being rendered to the screen, which means you have to render it yourself using the Image item, the Transform effect, a custom shader or the Render layer effect.\nYou should never leave buffers not rendered or hanging!\n\n"},"Effects/What-is-an-effect":{"title":"What is an effect?","links":[],"tags":[],"content":"What is an effect?\nKnown issues\n\n\n                  \n                  Alpha bug \n                  \n                \n\nSome effects will cause a confusion between dark colors and transparency, effectively creating unintended blending. You can sometimes remedy this by adding another effect on top - many advanced users choose to add the Crop effect and set all of its values to 0\n\n\n\n\n                  \n                  Duplicate bug \n                  \n                \n\nSometimes, especially in heavier projects, when adding an effect it might get added twice.\nIMPORTANT: Manually delete one of the effects. Do not reorder it!\nIf you do not do that, there is a high likelihood that your project will break on the next load.\n\n"},"Introduction/Concepts":{"title":"Concepts","links":["Items/What-is-an-item","Effects/What-is-an-effect"],"tags":[],"content":"💭 Concepts\nWhen we refer to the editor, we mean this page\nWhen we refer to the community page or creations page, we mean this page\nVizzy is a big program with a lot of features. We have many types of things that can be present in the editor. Here are some of them:\n\nItem - anything that produces an image\nLayer - a collection of items\nEffect - a post-processing node applied to layers or the composition\nComposition - an object holding all of the layers\nObject - everything you can interact with is an object\nAnalyzer - an object providing other objects with audio data\nAutomation - an object that can change other objects’ controller values\n\nThe hierarchy of the objects looks something like this:\n\nComposition\n\nLayers\n\nItems\n\nControllers\n\nAutomations\n\n\n\n\nLayer Effects\nTransform controls\n\n\nGlobal effects\n\n\n\nLayers, Effects and Automations are hierarchical:\n\nLayers get covered by other layers on top of them in the composition\nEffects get covered by other effects that are lower in the effects list\nAutomations are covered by other automations that are lower in the automations list, which means you can have a longer automation be interrupted by a shorter one if it is lower in the list\n\n\n\n                  \n                  Did you know? \n                  \n                \n\nThe Layer hierarchy used to be first-to-last, not last-to-first, but it did not match common video editing applications, so we changed it\n\n"},"Introduction/How-Vizzy-Works":{"title":"How Vizzy Works","links":[],"tags":[],"content":"⚙️ How Vizzy Works\nVizzy is a bit different from many other online video creation tools. Here’s the magic behind it:\nLocal rendering\nVizzy does all of its rendering directly in your web browser.\n\nIt’s free: Local rendering eliminates the need for expensive cloud infrastructure, making it possible for us to offer Vizzy for free\nYou’re in control: Whether you want to render a video with a custom resolution, or wildly inefficient settings, we won’t stop you - after all, it’s your computer\nNo internet, no problem: Even if your internet connection cuts out mid-render, since our editor runs on your computer, it will just continue the process\n\nVizzy leverages the power of modern web technologies, which allow it to do complex calculations and rendering right in your browser, without involving a powerful remote server.\nCloud-based storage\nWe still employ a cloud infrastructure to make your experience using the editor better:\n\nProject files: Your projects are automatically uploaded to our servers when you save them\nAsset storage: Any project assets you upload into the project are also saved to our servers\nCreations: If you choose to publish your project to the Creations page, others can view and remix it\n\n\n\n                  \n                  Did you know? \n                  \n                \n\nThe Media tab allows you to upload files that can be referenced across many projects, saving us some storage costs!\n\n\nMonetization\n\nWe are using advertisement spots on Vizzy to cover our server costs\nWe accept donations from our generous community\nWe do not sell your data1\n\n\n\n                  \n                  Disable your ad blocker! \n                  \n                \n\nWe rely on ads to sustain our service. If we do not get enough ad revenue, we will not be able to offer Vizzy for free anymore\n\n\nFootnotes\n\n\nSee our privacy policy ↩\n\n\n"},"Introduction/System-Requirements":{"title":"System Requirements","links":[],"tags":[],"content":"💻 System Requirements\nVizzy is designed to run well on a wide range of modern computers, but performance will depend on factors like your computer’s specifications, project complexity, resolution and others\n\n\n                  \n                  Warning! \n                  \n                \n\nVizzy is a desktop-first application! We do not offer active support for mobile browsers. You are likely to experience crashes and out-of-memory errors using mobile devices\n\n\nMinimum Requirements\n\nOperating system: Any operating system that supports a modern web browser. This includes Windows, macOS, Linux, and ChromeOS\nBrowser: We strongly recommend using the latest version of Google Chrome or a Chromium-based browser\nProcessor: A relatively modern multi-core processor (from the last 5-7 years) is recommended\nRAM: At least 4GB of available RAM. 8GB or more is recommended for longer audio files.\nGraphics: A dedicated graphics card (GPU) will significantly improve performance, but is not required!\nInternet: A stable internet connection is required to load Vizzy and save/load projects if using the online save feature.\n"},"Items/What-is-an-item":{"title":"What is an item?","links":["Buffers/What-is-a-buffer"],"tags":[],"content":"What is an item?\nAn Item is its own little contained renderer, producing an image to a buffer"},"Layers/Rendering-to-a-buffer":{"title":"Rendering to a buffer","links":[],"tags":[],"content":"Rendering to a buffer\nEach layer in Vizzy can be rendered to a buffer."},"Layers/What-is-a-layer":{"title":"What is a layer?","links":["Items/What-is-an-item","Buffers/What-is-a-buffer","Effects/What-is-an-effect"],"tags":[],"content":"What is a layer?\nLayers are objects in Vizzy through which items are rendered to the screen or to a buffer.\nhighlight\nLayer types\nThere are two layer types in Vizzy - 2D and 3D (Orthographic and Perspective), we might also call them camera types. The camera type is automatically selected based on the first item you add to the layer, but you can always change it by clicking the layer.\nOrthographic\nLayers using the orthographic projection use parallel lines to project an outline to a plane. Effectively, this means that objects within the camera’s clip plane will be the same size\nPerspective\nLayers using the perspective projection will simulate how the human eye or a camera see perspective, i.e. objects further away will appear smaller\n\n\nImage credit1\n\nTransform controls\nEach layer has something called transform controls.\n\nThese controls are none other than the controls for the layer’s camera. You can place the camera and the items in a layer anywhere in the 3D space\n\n\n                  \n                  Inverted scale \n                  \n                \n\nThe scale control of the layer is inverted, meaning setting the x scale to 0.5 will scale the objects to twice their original size along that axis, instead of half.\n\n\nEffects\nAll layers can have effects added to them.\nFootnotes\n\n\ngdbooks.gitbooks.io/legacyopengl/content/Chapter4/CoordinateTransforms.html#the-projection-transformation ↩\n\n\n"},"index":{"title":"Welcome to Vizzy!","links":["link-to-getting-started-guide"],"tags":[],"content":"👋 Welcome to Vizzy!\nGet ready to bring your music to life! Vizzy is a free, online music visualizer editor that lets you create stunning, unique videos that react to your audio. Whether you’re a musician, DJ, content creator, or just love experimenting with visuals, Vizzy gives you the power to design your own, eye-catching visuals, all within your web browser.\nWhat can you create?\nWith Vizzy, you can:\n\nCreate the perfect visuals that react to your audio tracks\nEasily sync text and animations to your song’s lyrics and create lyric videos\nPublish your projects to the Vizzy community, inspire others or get inspired yourself\nHave absolute freedom to create completely unique visuals\n\nOur mission\n\nWe want to give everyone the opportunity to create high-quality audiovisual content, for free, from any device\nWe have no plans to introduce any subscriptions or paid tiers (you can always donate!)\nWe believe that fostering a healthy community is as important as providing the service1\n\nReady to get started?\nVizzy is designed to be powerful yet intuitive. Jump right in and start experimenting, or check out our Getting Started guide for a quick tour!\n🚀 Launch the editor\nFootnotes\n\n\nJoin our Discord community - we’d love to see what you make! ↩\n\n\n"}}